RT-Thread/rt-thread/bsp/at32/libraries/f413/firmware/drivers/inc/at32f413_usb.h
  /* transmission buffer and count */
  uint16_t                               total_len;                   /*!< endpoint transmission total length */
  uint16_t                               trans_len;                   /*!< endpoint transmission length*/
  uint8_t                                *trans_buf;                  /*!< endpoint transmission buffer */

  uint16_t                               last_len;                    /*!< last transfer length */
  uint16_t                               rem0_len;                    /*!< rem transfer length */
  uint16_t                               ept0_slen;                   /*!< endpoint 0 transfer sum length */
}usb_ept_info;

/**
 * @brief type define usb register all
 */
typedef struct
{
  /**
  * @brief usb endpoint register, offset:0x00
  */
  union
  {
    __IO uint32_t ept[8];
    struct
    {
      __IO uint32_t eptaddr                  : 4; /* [3:0] */
      __IO uint32_t txsts                    : 2; /* [5:4] */
      __IO uint32_t txdts                    : 1; /* [6] */
      __IO uint32_t txtc                     : 1; /* [7] */
      __IO uint32_t exf                      : 1; /* [8] */
      __IO uint32_t trans_type               : 2; /* [10:9] */
      __IO uint32_t setuptc                  : 1; /* [11] */
      __IO uint32_t rxsts                    : 2; /* [13:12] */
      __IO uint32_t rxdts                    : 1; /* [14] */
      __IO uint32_t rxtc                     : 1; /* [15] */
      __IO uint32_t reserved1                : 16; /* [31:16] */
    } ept_bit[8];
  };

  __IO uint32_t reserved1[8];

  /**
  * @brief usb control register, offset:0x40
  */
  union
  {
    __IO uint32_t ctrl;
    struct
    {
      __IO uint32_t csrst                    : 1; /* [0] */
      __IO uint32_t disusb                   : 1; /* [1] */
      __IO uint32_t lpm                      : 1; /* [2] */
      __IO uint32_t ssp                      : 1; /* [3] */
      __IO uint32_t gresume                  : 1; /* [4] */
      __IO uint32_t reserved1                : 3; /* [7:5] */
      __IO uint32_t lsofien                  : 1; /* [8] */
      __IO uint32_t sofien                   : 1; /* [9] */
      __IO uint32_t rstien                   : 1; /* [10] */
      __IO uint32_t spien                    : 1; /* [11] */
      __IO uint32_t wkien                    : 1; /* [12] */
      __IO uint32_t beien                    : 1; /* [13] */
      __IO uint32_t ucforien                 : 1; /* [14] */
      __IO uint32_t tcien                    : 1; /* [15] */
      __IO uint32_t reserved2                : 16; /* [31:16] */
    } ctrl_bit;
  };

  /**
  * @brief usb interrupt status register, offset:0x44
  */
  union
  {
    __IO uint32_t intsts;
    struct
    {
      __IO uint32_t ept_num                  : 4; /* [3:0] */
      __IO uint32_t inout                    : 1; /* [4] */
      __IO uint32_t reserved1                : 3; /* [7:5] */
      __IO uint32_t lsof                     : 1; /* [8] */
      __IO uint32_t sof                      : 1; /* [9] */
      __IO uint32_t rst                      : 1; /* [10] */
      __IO uint32_t sp                       : 1; /* [11] */
      __IO uint32_t wk                       : 1; /* [12] */
      __IO uint32_t be                       : 1; /* [13] */
      __IO uint32_t ucfor                    : 1; /* [14] */
      __IO uint32_t tc                       : 1; /* [15] */
      __IO uint32_t reserved2                : 16; /* [31:16] */
    } intsts_bit;
  };

  /**
  * @brief usb frame number register, offset:0x48
  */
  union
  {
    __IO uint32_t sofrnum;
    struct
    {
      __IO uint32_t sofnum                   : 11; /* [10:0] */
      __IO uint32_t lsofnum                  : 2; /* [12:11] */
      __IO uint32_t clck                     : 1; /* [13] */
      __IO uint32_t dmsts                    : 1; /* [14] */
      __IO uint32_t dpsts                    : 1; /* [15] */
      __IO uint32_t reserved1                : 16; /* [31:16] */
    } sofrnum_bit;
  };

  /**
  * @brief usb device address register, offset:0x4c
  */
  union
  {
    __IO uint32_t devaddr;
    struct
    {
      __IO uint32_t addr                     : 7; /* [6:0] */
      __IO uint32_t cen                      : 1; /* [7] */
      __IO uint32_t reserved1                : 24; /* [31:8] */
    } devaddr_bit;
  };

  /**
  * @brief usb buffer address register, offset:0x50
  */
  union
  {
    __IO uint32_t buftbl;
    struct
    {
      __IO uint32_t reserved1                : 3; /* [2:0] */
      __IO uint32_t btaddr                   : 13; /* [15:3] */
      __IO uint32_t reserved2                : 16; /* [31:16] */
    } buftbl_bit;
  };
  __IO uint32_t reserved2[3];
  /**
  * @brief usb cfg control register, offset:0x60
  */
  union
  {
    __IO uint32_t cfg;
    struct
    {
      __IO uint32_t sofouten                 : 1; /* [0] */
      __IO uint32_t reserved1                : 31; /* [31:1] */
    } cfg_bit;
  };

} usbd_type;

/**
  * @}
  */

#define USB                              ((usbd_type *) USBFS_BASE)

typedef usbd_type usb_reg_type;
extern uint32_t g_usb_packet_address;

/** @defgroup USB_exported_functions
  * @{
  */

void usb_dev_init(usbd_type *usbx);
void usb_connect(usbd_type *usbx);
void usb_disconnect(usbd_type *usbx);
void usb_usbbufs_enable(usbd_type *usbx, confirm_state state);
void usb_ept_open(usbd_type *usbx, usb_ept_info *ept_info);
void usb_ept_close(usbd_type *usbx, usb_ept_info *ept_info);
void usb_write_packet(uint8_t *pusr_buf, uint16_t offset_addr, uint16_t nbytes);
void usb_read_packet(uint8_t *pusr_buf, uint16_t offset_addr, uint16_t nbytes);
void usb_interrupt_enable(usbd_type *usbx, uint16_t interrupt, confirm_state new_state);
void usb_set_address(usbd_type *usbx, uint8_t address);
void usb_ept_stall(usbd_type *usbx, usb_ept_info *ept_info);
void usb_enter_suspend(usbd_type *usbx);
void usb_exit_suspend(usbd_type *usbx);
void usb_remote_wkup_set(usbd_type *usbx);
void usb_remote_wkup_clear(usbd_type *usbx);
uint16_t usb_buffer_malloc(uint16_t maxpacket);
void usb_buffer_free(void);
flag_status usb_flag_get(usbd_type *usbx, uint16_t flag);
void usb_flag_clear(usbd_type *usbx, uint16_t flag);


#ifdef __cplusplus
}
#endif

#endif
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
